package game.module.miner
{
	/**
	 * @author jian
	 */
	public class MinerManager
	{
		// ===============================================================
		// 矿工系统
		// 1. 副本地图，设置若干采矿点，玩家可以在采矿点上采矿，获得强化石。
		// 2. 玩家进入采矿区域，换矿工装。玩家离开采矿区域，换回正常装束。
		// 3. 玩家有小矿骡。小矿骡跟随玩家。小矿骡可以点击，弹出矿篓窗口。
		// 4. 采矿有动画。
		// 5. 每日采矿有次数限制
		// ===============================================================
		
		// ===============================================================
		// 单例
		// ===============================================================
		private static var __instance : MinerManager;

		public static function get instance() : MinerManager
		{
			if (!__instance)
				__instance = new MinerManager();

			return __instance;
		}

		public function MinerManager()
		{
			if (__instance)
				throw ("单例错误！");

			__instance = this;
		}
		
		// ===============================================================
		// 属性
		// ===============================================================
		
		// 玩家状态
		// 0: 未进入矿区，1: 进入矿区，2: 采矿中
		private var _playerState:int;

	}
}
